app/views/users/_index.html.erb

SELECT "users".* FROM "users"
---
  var app = angular.module("myApp", []);
  app.controller('myController', function ($scope, $http) {
//    url =    'http://localhost:3000/jsonusers';
    url = 'http://bootonrb.herokuapp.com/jsonusers';
    $http.get(url).success(function (response) {
      $scope.users = response;

    });

  });