app/controllers/jsonuserdata_controller.rb

SELECT "jsonuserdata".* FROM "jsonuserdata"
---
  def index
    @jsonuserdata = Jsonuserdata.all

INSERT INTO "jsonuserdata" ("created_at", "name", "status", "updated_at", "usertype") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 17 Mar 2016 18:10:12 UTC +00:00], ["name", "safdar"], ["status", "new"], ["updated_at", Thu, 17 Mar 2016 18:10:12 UTC +00:00], ["usertype", "admin"]]
---
  def create
    @jsonuserdata = jsonuserdata.new(jsonuserdata_params)

    respond_to do |format|
      if @jsonuserdata.save