app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "name", "status", "updated_at", "usertype") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 07 Feb 2016 17:17:19 UTC +00:00], ["name", "Safdar Ali"], ["status", "Allowed"], ["updated_at", Sun, 07 Feb 2016 17:17:19 UTC +00:00], ["usertype", "Admin"]]
SELECT "users".* FROM "users"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
        @users = User.all

UPDATE "users" SET "usertype" = ?, "updated_at" = ? WHERE "users"."id" = 14  [["usertype", "New"], ["updated_at", Tue, 09 Feb 2016 04:50:26 UTC +00:00]]
SELECT "users".* FROM "users"
---
  def update

    respond_to do |format|
      if @user.update(user_params)
        @users = User.all

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]
SELECT "users".* FROM "users"
---
  def destroy
    @user.destroy
    @users = User.all